use mermaid for diagramms and convert them to svg via skript
